package com.util;

import org.junit.Test;

import java.util.*;

public class Infor {
    //姓
    String xing[] = {
            "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "叶", "幸", "司", "韶", "郜", "黎", "蓟", "薄",
            "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂",
            "朱", "秦", "尤", "许", "何", "吕", "施", "张", "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙",
            "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "池", "乔", "阴", "鬱", "胥", "能", "苍", "双",
            "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄",
            "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍",
            "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "卻", "璩", "桑", "桂", "濮", "牛", "寿", "通",
            "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农",
            "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "温", "别", "庄", "晏", "柴", "瞿", "阎", "充",
            "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容",
            "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "向", "古", "易", "慎", "戈", "廖", "庾", "终",
            "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "暨", "居", "衡", "步", "都", "耿", "满", "弘",
            "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪", "匡", "国", "文", "寇", "广", "禄", "阙", "东",
            "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆",
            "计", "伏", "成", "戴", "谈", "宋", "茅", "庞", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融",
            "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "冷", "訾", "辛", "阚", "那", "简", "饶", "空",
            "杜", "阮", "蓝", "闵", "席", "季", "麻", "强", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰",
            "贾", "路", "娄", "危", "江", "童", "颜", "郭", "巢", "关", "蒯", "相", "查", "后", ",荆", "红",
            "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆", "游", "竺", "权", "逯", "盖", "益", "桓", "公",
            "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍", "万俟", "司马", "上官", "欧阳", "束", "龙",
            "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "夏侯", "诸葛", "闻人", "东方", "景", "詹",
            "经", "房", "裘", "缪", "干", "解", "应", "宗", "赫连", "皇甫", "尉迟", "公羊", "武", "符",
            "丁", "宣", "贲", "邓", "郁", "单", "杭", "洪", "澹台", "公冶", "宗政", "濮阳", "厉", "戎",
            "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "淳于", "单于", "太叔", "申屠", "甘", "钭",
            "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁", "公孙", "仲孙", "轩辕", "令狐", "栾", "暴",
            "荀", "羊", "於", "惠", "甄", "曲", "家", "封", "钟离", "宇文", "长孙", "慕容", "宁", "仇",
            "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "鲜于", "闾丘", "司徒", "司空", "班", "仰",
            "井", "段", "富", "巫", "乌", "焦", "巴", "弓", "祖", "伊", "宫", "秋", "仲", "全", "郗",
            "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬"

    };
    //名
    String ming[] = {
            "一", "是", "在", "不", "了", "有", "和", "人", "这", "中", "大", "为", "上", "个", "国", "以", "要", "他", "晓", "芳", "换", "患", "荒", "慌", "皇", "黄", "煌", "活", "火", "伙", "或", "货", "获", "祸", "惑", "击", "晃", "谎", "耍",
            "时", "来", "用", "们", "生", "到", "作", "地", "于", "出", "就", "分", "对", "成", "会", "可", "主", "发", "年", "动", "饥", "绘", "贿", "惠", "毁", "慧", "昏", "婚", "浑", "魂", "混", "奸", "尖", "坚", "歼", "较", "教", "阶", "衰",
            "同", "工", "也", "能", "下", "过", "子", "产", "种", "面", "而", "方", "后", "多", "定", "行", "学", "所", "剂", "季", "间", "肩", "艰", "兼", "监", "煎", "拣", "俭", "茧", "捡", "价", "驾", "架", "假", "嫁", "稼", "灰", "恢", "摔",
            "民", "得", "经", "十", "三", "之", "进", "着", "等", "部", "度", "家", "电", "里", "如", "水", "化", "高", "自", "酱", "交", "皆", "接", "揭", "街", "节", "劫", "杰,", "洁", "结", "捷", "绞", "饺", "脚", "搅", "缴", "叫", "轿", "甩",
            "二", "理", "起", "小", "物", "现", "实", "加", "量", "都", "两", "体", "制", "机", "当", "使", "点", "从", "业", "本", "茎", "惊", "酒", "旧", "救", "就", "舅", "居", "拘", "鞠", "局", "菊", "竟", "敬", "境", "静", "镜", "纠", "帅",
            "去", "把", "好", "应", "开", "它", "合", "还", "因", "由", "其", "些", "然", "前", "外", "天", "政", "四", "日", "究", "揪", "九", "久", "垦", "恳", "坑", "空", "蓝", "篮", "览", "链", "良", "凉", "碌", "路", "驴", "挥", "辉", "拴",
            "那", "社", "义", "事", "平", "形", "相", "全", "表", "间", "样", "与", "关", "各", "重", "新", "线", "内", "数", "正", "扛", "抗", "炕", "考", "烤", "靠", "科", "棵", "颗", "壳", "咳", "可", "渴", "克", "刻", "客", "课", ",肯", "泽",
            "心", "反", "你", "明", "看", "原", "又", "么", "利", "比", "或", "但", "质", "气", "第", "向", "道", "命", "此", "变", "喇", "腊", "懒", "烂", "滥", "郎", "狼", "廊", "朗", "浪", "捞", "劳", "蜡", "辣", "来", "赖", "兰", "拦", "栏",
            "条", "只", "没", "结", "解", "问", "意", "建", "月", "公", "无", "系", "军", "很", "情", "者", "最", "立", "代", "想", "丽", "利", "梁", "粮", "粱", "两", "亮", "谅", "辆", "量", "辽", "疗", "联", "廉", "镰", "脸", "练", "炼", "恋",
            "已", "通", "并", "提", "直", "题", "党", "程", "展", "五", "果", "料", "象", "员", "革", "位", "入", "常", "文", "总", "六", "龙", "旅", "屡", "律", "虑", "率", "绿", "卵", "乱", "掠", "略", "炉", "虏", "鲁", "陆", "录", "鹿", "滤",
            "次", "品", "式", "活", "设", "及", "管", "特", "件", "长", "求", "老", "头", "基", "资", "边", "流", "路", "级", "少", "盲", "茫", "猫", "毛", "矛", "茅", "茂", "冒", "迈", "麦", "卖", "脉", "蛮", "馒", "瞒", "满", "慢", "漫", "美",
            "图", "山", "统", "接", "知", "较", "将", "组", "见", "计", "别", "她", "手", "角", "期", "根", "论", "运", "农", "指", "妹", "门", "闷", "们", "萌", "盟", "猛", "蒙", "孟", "贸", "帽", "貌", "么", "没", "眉", "梅", "煤", "霉", "每",
            "几", "九", "区", "强", "放", "决", "西", "被", "干", "做", "必", "战", "先", "回", "则", "任", "取", "据", "队", "棉", "免", "勉", "面", "苗", "描", "秒", "妙", "庙", "灭", "梦", "迷", "谜", "米", "眯", "秘", "密", "蜜", "眠", "绵",
            "南", "给", "色", "光", "门", "即", "保", "治", "北", "造", "百", "规", "热", "领", "七", "海", "口", "东", "导", "器", "幕", "慕", "尼", "泥", "你", "逆", "年", "念", "娘", "酿", "鸟", "尿", "南", "难", "囊", "挠", "恼", "脑", "闹",
            "压", "志", "世", "金", "增", "争", "济", "阶", "油", "术", "极", "交", "受", "联", "什", "认", "六", "共", "权", "嫩", "能", "汇", "会", "缓", "幻", "唤", "蓬", "膨", "捧", "匹", "僻", "片", "赔", "佩", "配", "喷", "盆", "朋", "棚",
            "收", "证", "改", "清", "己", "美", "再", "采", "转", "更", "单", "风", "切", "打", "白", "速", "花", "带", "安", "回", "悔", "盼", "碰", "批", "披", "劈", "皮", "疲", "脾", "起", "气", "弃", "区", "曲", "驱", "嗓", "丧", "扫", "支",
            "场", "身", "车", "例", "真", "务", "具", "万", "每", "目", "至", "达", "走", "积", "示", "议", "声", "报", "斗", "完", "朴", "普", "汽", "砌", "器", "恰", "洽", "千", "迁", "牵", "铅", "谦", "骑", "棋", "旗", "乞", "企", "岂", "启",
            "类", "八", "离", "华", "名", "确", "才", "科", "张", "信", "马", "节", "话", "米", "整", "空", "元", "况", "今", "集", "芹", "琴", "屈", "趋", "渠", "取", "去", "趣", "圈", "全", "权", "泉", "请", "庆", "穷", "丘", "秋", "求", "球",
            "温", "传", "土", "许", "步", "群", "广", "石", "记", "需", "段", "研", "界", "拉", "林", "律", "叫", "且", "究", "观", "扔", "仍", "乳", "辱", "入", "软", "锐", "瑞", "润", "若", "弱", "撒", "洒", "塞", "赛", "三", "伞", "散", "桑",
            "越", "织", "影", "算", "低", "持", "音", "众", "书", "布", "复", "容", "儿", "须", "际", "商", "非", "验", "连", "少", "绍", "慎", "升", "生", "声", "牲", "胜", "绳", "省", "圣", "盛", "伸", "身", "深", "神", "沈", "审", "婶", "肾",
            "断", "深", "难", "近", "矿", "千", "周", "委", "素", "技", "备", "半", "办", "青", "省", "列", "习", "响", "约", "甚", "渗", "侍", "势", "书", "叔", "殊", "梳", "疏", "舒", "输", "蔬", "熟", "暑", "收", "手", "守", "首", "寿", "受",
            "般", "史", "感", "劳", "便", "团", "往", "酸", "历", "市", "克", "何", "除", "消", "构", "府", "称", "太", "准", "精", "兽", "售", "授", "瘦", "私", "思", "速", "宿", "塑", "酸", "蒜", "算", "虽", "随", "岁", "碎", "诵", "送", "颂",
            "值", "号", "率", "族", "维", "划", "选", "标", "写", "存", "候", "毛", "亲", "快", "效", "斯", "院", "查", "江", "型", "搜", "艘", "苏", "俗", "诉", "肃", "素", "惕", "替", "天", "添", "田", "甜", "填", "挑", "条", "跳", "特", "疼",
            "眼", "王", "按", "格", "养", "易", "置", "派", "层", "始", "却", "专", "状", "育", "厂", "京", "识", "适", "属", "腾", "梯", "踢", "提", "题", "蹄", "体", "剃", "多", "夺", "掏", "滔", "逃", "桃", "陶", "淘", "萄", "讨", "套", "汤",
            "圆", "包", "火", "住", "调", "满", "县", "局", "照", "参", "红", "细", "引", "听", "该", "铁", "价", "严", "龙", "飞", "唐", "堂", "塘", "膛", "糖", "倘", "躺", "烫", "趟", "摊", "滩", "坛", "谈", "痰", "毯", "叹", "炭", "探", "锻",
            "化", "划", "画", "话", "怀", "槐", "坏", "欢", "还", "环", "蝴", "虎", "互", "户", "护", "花", "华", "哗", "滑", "猾", "堆", "队", "对", "吨", "蹲", "盾", "顿", "数", "刷", "斯", "撕", "四", "寺", "似", "饲", "肆", "松", "宋", "水",
            "吉", "级", "即", "极", "急", "疾", "集", "籍", "几", "己", "圾", "机", "肌", "迹", "积", "基", "绩", "激", "及", "既", "济", "继", "寄", "加", "夹", "佳", "家", "嘉", "甲", "挤", "脊", "计", "记", "纪", "忌", "技", "际", "税", "睡",
            "健", "舰", "渐", "践", "鉴", "键", "箭", "江", "姜", "将", "减", "剪", "检", "简", "见", "件", "建", "剑", "荐", "贱", "郊", "娇", "浇", "骄", "胶", "椒", "焦", "蕉", "角", "狡", "浆", "僵", "疆", "讲", "奖", "桨", "匠", "降", "顺",
            "今", "斤", "金", "津", "筋", "仅", "紧", "谨", "锦", "尽", "截", "竭", "姐", "解", "介", "戒", "届", "界", "借", "巾", "晶", "睛", "精", "井", "颈", "景", "警", "净", "径", "竞", "劲", "近", "进", "晋", "浸", "禁", "京", "经", "丝",
            "橘", "举", "矩", "句", "巨", "拒", "具", "俱", "剧", "惧", "据", "距", "锯", "聚", "捐", "卷", "倦", "绢", "决", "绝", "觉", "掘", "嚼", "军", "君", "均", "菌", "俊", "卡", "开", "凯", "慨", "刊", "堪", "砍", "看", "康", "糠", "司",
            "孔", "恐", "控", "口", "扣", "寇", "枯", "苦", "库", "裤", "酷", "夸", "垮", "挎", "跨", "块", "快", "宽", "款", "筐", "狂", "况", "旷", "矿", "框", "亏", "葵", "愧", "昆", "捆", "困", "扩", "括", "阔", "垃", "拉", "啦", "说", "嗽",
            "累", "冷", "厘", "梨", "狸", "离", "犁", "鹂", "璃", "黎", "牢", "老", "姥", "涝", "乐", "勒", "雷", "垒", "泪", "类", "励", "例", "隶", "栗", "粒", "俩", "连", "帘", "怜", "莲", "礼", "李", "里", "理", "力", "历", "厉", "立", "霜",
            "临", "淋", "伶", "灵", "岭", "铃", "陵", "零", "龄", "领", "僚", "了", "料", "列", "劣", "烈", "猎", "裂", "邻", "林", "笼", "聋", "隆", "垄", "拢", "楼", "搂", "漏", "露", "芦", "令", "另", "溜", "刘", "流", "留", "榴", "柳", "爽",
            "落", "妈", "麻", "马", "埋", "买", "轮", "论", "罗", "萝", "锣", "箩", "骡", "螺", "络", "骆",  "塌", "塔", "踏", "台", "抬", "太", "态", "泰", "贪", "穗", "孙", "损", "笋", "缩", "所", "索", "锁", "她", "他", "忙", "芒", "谁",
            "摩", "磨", "魔", "抹", "末", "沫", "莫", "漠", "墨", "默", "蔑", "民", "敏", "名", "明", "鸣", "命", "摸", "模", "膜", "暮", "拿", "哪", "内", "那", "纳", "乃", "奶", "耐", "男", "谋", "某", "母", "亩", "木", "目", "牧", "墓", "鼠",
            "奴", "努", "怒", "女", "暖", "挪", "欧", "偶", "辟", "趴", "捏", "您", "宁", "凝", "牛", "扭", "纽", "农", "弄", "乓", "旁", "胖", "抛", "炮", "袍", "跑", "泡", "陪", "培", "爬", "怕", "拍", "牌", "派", "攀", "盘", "判", "叛", "属",
            "乒", "平", "评", "凭", "苹", "瓶", "萍", "坡", "泼", "婆", "偏", "篇", "骗", "漂", "飘", "票", "撇", "拼", "贫", "品", "谱", "七", "妻", "戚", "期", "欺", "漆", "齐", "其", "奇", "迫", "破", "魄", "剖", "仆", "扑", "铺", "葡", "薯",
            "腔", "强", "墙", "抢", "悄", "敲", "锹", "乔", "侨", "桥", "签", "前", "钱", "钳", "潜", "浅", "遣", "欠", "歉", "枪", "禽", "勤", "青", "轻", "倾", "清", "蜻", "情", "晴", "顷", "瞧", "巧", "切", "茄", "且", "窃", "亲", "侵", "术",
            "群", "然", "燃", "染", "嚷", "壤", "让", "饶", "扰", "绕", "拳", "犬", "劝", "券", "缺", "却", "雀", "确", "鹊", "裙", "日", "绒", "荣", "容", "熔", "融", "柔", "揉", "肉", "如", "惹", "热", "人", "仁", "忍", "刃", "认", "任", "束",
            "删", "衫", "闪", "陕", "扇", "善", "伤", "商", "裳", "晌", "森", "杀", "沙", "纱", "傻", "筛", "晒", "山", "哨", "舌", "蛇", "舍", "设", "社", "射", "涉", "摄", "申", "赏", "上", "尚", "捎", "梢", "烧", "稍", "勺", "树", "竖", "述",
            "石", "时", "识", "实", "拾", "蚀", "食", "史", "使", "始", "剩", "尸", "失", "师", "诗", "施", "狮", "湿", "十", "什", "视", "试", "饰", "室", "是", "柿", "适", "逝", "释", "誓", "驶", "士", "氏", "世", "市", "示", "式", "事", "双",
            "倍" ,"倦" ,"健", "臭" ,"射", "躬" ,"息" ,"徒", "徐","舰" ,"舱" ,"般" ,"航", "途" ,"拿" ,"爹" ,"爱", "颂" ,"翁" ,"脆" ,"脂", "胸","胳","脏" ,"胶" ,"脑", "狸" ,"狼", "逢", "留" ,"皱", "饿" ,"恋", "桨", "浆" ,"衰", "高" ,"席", "准" ,"座",
            "脊" ,"症", "病" ,"疾", "疼" ,"疲","效" ,"离", "唐", "资", "凉" ,"站", "剖","竞" ,"部" ,"旁" ,"旅" ,"畜" ,"阅" ,"羞" ,"瓶" ,"拳" ,"粉" ,"料" ,"益", "兼" ,"烤" ,"烘", "烦" ,"烧","烛" ,"烟" ,"递", "涛" ,"浙" ,"涝" ,"酒" ,"涉", "消" ,"浩", "海" ,"涂" ,"浴" ,"浮", "流" ,"润" ,"浪" ,"浸" ,"涨", "烫" ,"涌" ,"悟", "悄" ,"悔" ,"悦",
            "害" ,"宽" ,"家", "宵" ,"宴" ,"宾" ,"窄" ,"容", "宰" ,"案", "请" ,"朗" ,"诸" ,"读", "扇" ,"袜" ,"袖" ,"袍" ,"被" ,"祥" ,"课" ,"谁" ,"调" ,"冤", "谅",
            "谈" ,"谊" ,"剥", "恳" ,"展" ,"剧" ,"屑" ,"弱", "陵" ,"陶", "陷" ,"陪" ,"娱" ,"娘" ,"通" ,"能" ,"难" ,"预" ,"桑" ,"绢" ,"绣" ,"验" ,"继" ,"球" ,"理",
            "捧" ,"堵" ,"描" ,"域" ,"掩" ,"捷" ,"排" ,"掉", "堆" ,"推", "掀" ,"授" ,"教" ,"掏" ,"掠" ,"培" ,"接" ,"控" ,"探" ,"据" ,"掘" ,"职" ,"基" ,"著" ,"勒",
            "黄" ,"萌" ,"萝" ,"菌" ,"菜" ,"萄" ,"菊" ,"萍", "菠" ,"营", "械" ,"梦" ,"梢" ,"梅", "检" ,"梳" ,"梯" ,"桶" ,"救" ,"副" ,"票" ,"戚" ,"爽" ,"聋" ,"袭" ,"盛",
            "雪" ,"辅" ,"辆" ,"虚" ,"雀" ,"堂" ,"常" ,"匙", "晨" ,"睁" ,"眯" ,"眼" ,"悬" ,"野" ,"啦" ,"晚" ,"啄" ,"距" ,"跃" ,"略" ,"蛇" ,"累" ,"唱" ,"患" ,"唯" ,"崖",
            "崭" ,"崇" ,"圈" ,"铜" ,"铲" ,"银" ,"甜" ,"梨", "犁" ,"移" ,"笨" ,"笼" ,"笛" ,"符" ,"第" ,"敏" ,"做" ,"袋" ,"悠" ,"偿" ,"偶" ,"偷" ,"您" ,"售" ,"停" ,"偏",
            "假" ,"得" ,"衔" ,"盘" ,"船" ,"斜" ,"盒" ,"鸽", "悉" ,"欲" ,"彩" ,"领" ,"脚" ,"脖" ,"脸" ,"脱" ,"象" ,"够" ,"猜" ,"猪" ,"猎" ,"猫" ,"猛" ,"馅" ,"馆" ,"凑",
            "减" ,"毫" ,"麻" ,"痒" ,"痕" ,"廊" ,"康" ,"庸", "鹿" ,"盗" ,"章" ,"竟" ,"商" ,"族" ,"旋" ,"望" ,"率" ,"着" ,"盖" ,"粘" ,"粗" ,"粒" ,"断" ,"剪" ,"兽" ,"清",
            "添" ,"淋" ,"淹" ,"渠" ,"渐" ,"混" ,"渔" ,"淘", "液" ,"淡" ,"深" ,"婆" ,"梁" ,"渗" ,"情" ,"惜" ,"惭" ,"悼" ,"惧" ,"惕" ,"惊" ,"惨" ,"惯" ,"寇" ,"寄" ,"宿",
            "窑" ,"密" ,"谋" ,"谎" ,"祸" ,"谜" ,"逮" ,"敢" ,"屠" ,"弹" ,"随" ,"蛋" ,"隆" ,"隐" ,"婚" ,"婶" ,"颈" ,"绩" ,"绪" ,"续" ,"骑" ,"绳" ,"维" ,"绵" ,"绸" ,"绿",
            "琴" ,"斑" ,"替" ,"款" ,"堪" ,"搭" ,"塔" ,"越" ,"趁" ,"趋" ,"超" ,"提" ,"堤" ,"博" ,"揭" ,"喜" ,"插" ,"揪" ,"搜" ,"煮" ,"援" ,"裁" ,"搁" ,"搂" ,"搅" ,"握",
            "揉" ,"斯" ,"期" ,"欺" ,"联" ,"散" ,"惹" ,"葬" ,"葛" ,"董" ,"葡" ,"敬" ,"葱" ,"落" ,"朝" ,"辜" ,"葵" ,"棒" ,"棋" ,"植" ,"森" ,"椅" ,"椒" ,"棵" ,"棍" ,"棉",
            "棚" ,"棕" ,"惠" ,"惑" ,"逼" ,"厨" ,"厦" ,"硬" ,"确" ,"雁" ,"殖" ,"裂" ,"雄" ,"暂" ,"雅" ,"辈" ,"悲" ,"紫" ,"辉" ,"敞" ,"赏" ,"掌" ,"晴" ,"暑" ,"最" ,"量" ,"喷",
            "晶" ,"喇" ,"遇" ,"喊" ,"景" ,"践" ,"跌" ,"跑" ,"遗" ,"蛙" ,"蛛" ,"蜓" ,"喝" ,"喂" ,"喘" ,"喉" ,"幅" ,"帽" ,"赌" ,"赔" ,"黑" ,"铸" ,"铺" ,"链" ,"销" ,"锁" ,"锄",
            "锅" ,"锈" ,"锋" ,"锐" ,"短" ,"智" ,"毯" ,"鹅" ,"剩" ,"稍" ,"程" ,"稀" ,"税" ,"筐" ,"等" ,"筑" ,"策" ,"筛" ,"筒" ,"答" ,"筋" ,"筝" ,"傲" ,"傅" ,"牌" ,"堡" ,"集",
            "焦" ,"傍" ,"储" ,"奥" ,"街" ,"惩" ,"御" ,"循" ,"艇" ,"舒" ,"番" ,"释" ,"禽" ,"腊" ,"脾" ,"腔" ,"鲁" ,"猾" ,"猴,", "然", "馋", "装", "蛮", "就", "痛", "童", "阔",
            "善" ,"羡" ,"普" ,"粪" ,"尊" ,"道" ,"曾" ,"焰" ,"港" ,"湖" ,"渣" ,"湿" ,"温" ,"渴" ,"滑" ,"湾" ,"渡" ,"游" ,"滋" ,"溉" ,"愤" ,"慌" ,"惰" ,"愧" ,"愉" ,"慨" ,"割",
            "寒" ,"富" ,"窜" ,"窝" ,"窗" ,"遍" ,"裕" ,"裤" ,"裙" ,"谢" ,"谣" ,"谦" ,"属" ,"屡" ,"强" ,"粥" ,"疏" ,"隔" ,"隙" ,"絮" ,"嫂" ,"登" ,"缎" ,"缓" ,"编" ,"骗" ,"缘",
            "瑞" ,"魂" ,"肆" ,"摄" ,"摸" ,"填" ,"搏" ,"塌" ,"鼓" ,"摆" ,"携" ,"搬" ,"摇" ,"搞" ,"塘" ,"摊" ,"蒜" ,"勤" ,"鹊" ,"蓝" ,"墓" ,"幕" ,"蓬" ,"蓄" ,"蒙" ,"蒸" ,"献",
            "禁" ,"楚" ,"想" ,"槐" ,"榆" ,"楼" ,"概" ,"赖" ,"酬" ,"感" ,"碍" ,"碑" ,"碎" ,"碰" ,"碗" ,"碌" ,"雷" ,"零" ,"雾" ,"雹" ,"输" ,"督" ,"龄" ,"鉴" ,"睛" ,"睡" ,"睬",
            "鄙" ,"愚" ,"暖" ,"盟" ,"歇" ,"暗" ,"照" ,"跨" ,"跳" ,"跪" ,"路" ,"跟" ,"遣" ,"蛾" ,"蜂" ,"嗓" ,"置" ,"罪" ,"罩" ,"错" ,"锡" ,"锣" ,"锤" ,"锦" ,"键" ,"锯" ,"矮",
            "辞" ,"稠" ,"愁" ,"筹" ,"签" ,"简" ,"毁" ,"舅" ,"鼠" ,"催" ,"傻" ,"像" ,"躲" ,"微" ,"愈" ,"遥" ,"腰" ,"腥" ,"腹" ,"腾" ,"腿" ,"触" ,"解" ,"酱" ,"痰" ,"廉" ,"新",
            "韵" ,"意" ,"粮" ,"数" ,"煎" ,"塑" ,"慈" ,"煤" ,"煌" ,"满" ,"漠" ,"源" ,"滤" ,"滥" ,"滔" ,"溪" ,"溜" ,"滚" ,"滨" ,"粱" ,"滩" ,"慎" ,"誉" ,"塞" ,"谨" ,"福" ,"群",
            "殿" ,"辟" ,"障" ,"嫌" ,"嫁" ,"叠" ,"缝" ,"缠" ,"静" ,"碧" ,"璃" ,"墙" ,"撇" ,"嘉" ,"摧" ,"截" ,"誓" ,"境" ,"摘" ,"摔" ,"聚" ,"蔽" ,"慕" ,"暮" ,"蔑" ,"模" ,"榴",
            "榜" ,"榨" ,"歌" ,"遭" ,"酷" ,"酿" ,"酸" ,"磁" ,"愿" ,"需" ,"弊" ,"裳" ,"颗" ,"嗽" ,"蜻" ,"蜡" ,"蝇" ,"蜘" ,"赚" ,"锹" ,"锻" ,"舞" ,"稳" ,"算" ,"箩" ,"管" ,"僚",
            "鼻" ,"魄" ,"貌" ,"膜" ,"膊" ,"膀" ,"鲜" ,"疑" ,"馒" ,"裹" ,"敲" ,"豪" ,"膏" ,"遮" ,"腐" ,"瘦" ,"辣" ,"竭" ,"端" ,"旗" ,"精" ,"歉" ,"熄" ,"熔" ,"漆" ,"漂" ,"漫",
            "滴" ,"演" ,"漏" ,"慢" ,"寨" ,"赛" ,"察" ,"蜜" ,"谱" ,"嫩" ,"翠" ,"熊" ,"凳" ,"骡" ,"缩" ,"慧" ,"撕" ,"撒" ,"趣" ,"趟" ,"撑" ,"播" ,"撞" ,"撤" ,"增" ,"聪" ,"鞋",
            "蕉" ,"蔬" ,"横" ,"槽" ,"樱" ,"橡" ,"飘" ,"醋" ,"醉" ,"震" ,"霉" ,"瞒" ,"题" ,"暴" ,"瞎" ,"影" ,"踢" ,"踏" ,"踩" ,"踪" ,"蝶" ,"蝴" ,"嘱" ,"墨" ,"镇" ,"靠" ,"稻",
            "黎" ,"稿" ,"稼" ,"箱" ,"箭" ,"篇" ,"僵" ,"躺" ,"僻" ,"德" ,"艘" ,"膝" ,"膛" ,"熟" ,"摩" ,"颜" ,"毅" ,"糊" ,"遵" ,"潜" ,"潮" ,"懂" ,"额" ,"慰" ,"劈" ,"操" ,"燕",
            "薯" ,"薪" ,"薄" ,"颠" ,"橘" ,"整" ,"融" ,"醒" ,"餐" ,"嘴" ,"蹄" ,"器" ,"赠" ,"默" ,"镜" ,"赞" ,"篮" ,"邀" ,"衡" ,"膨" ,"雕" ,"磨" ,"凝" ,"辨" ,"辩" ,"糖" ,"糕",
            "燃" ,"澡" ,"激" ,"懒" ,"壁" ,"避" ,"缴" ,"戴" ,"擦" ,"鞠" ,"藏" ,"霜" ,"霞", "瞧" ,"蹈" ,"螺" ,"穗" ,"繁" ,"辫", "赢" ,"糟", "糠" ,"燥" ,"臂" ,"翼",

    };
    //市
    String sichuan[] = {
            "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "眉山市", "广安市", "达州市",
            "雅安市", "资阳市", "成都市", "乐山市", "宜宾市", "南充市", "巴中市", "阿坝藏族羌族自治州", "甘孜藏族自治州",
            "凉山彝族自治州"
    };
    String jiangs[] = {"扬州", "镇江", "宿迁", "连云港", "徐州", "淮安", "盐城", "泰州", "常州", "无锡", "苏州", "南京", "南通"};

    String gans[] = {"嘉峪关市", "金昌市", "白银市", "武威市", "酒泉市", "平凉市", "庆阳市", "陇南市", "天水市", "定西市", "兰州市", "张掖市", "甘南藏族自治州", "临夏回族自治州"};

    String ningx[] = {"石嘴山市", "吴忠市", "固原市", "中卫市", "银川市"};

    String xinj[] = {"克拉玛依市", "吐鲁番地区", "哈密地区", "昌吉回族自治州", "和田地区", "阿克苏地区", "喀什地区", "克孜勒苏柯尔克孜自治州",
            "巴音郭楞蒙古自治州", "博尔塔拉蒙古自治州", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "乌鲁木齐市"
    };
    String beij[] = {"延庆县", "密云县", "怀柔区", "昌平区", "顺义区", "平谷区", "顺义区", "海淀区", "东城区", "朝阳区", "西城区", "门头沟区", "石景山区", "丰台区", "房山区", "大兴区"};

    String shanghi[] = {"杨浦区", "黄浦区", "虹口区", "闸北区", "静安区", "普陀区", "长宁区", "徐汇区", "浦东新区", "闵行区", "宝山区", "嘉定区", "青浦区", "松江区", "奉贤区", "金山区"};

    String guangdo[] = {"珠海市", "汕头市", "韶关市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "河源市", "阳江市", "清远市", "中山市", "揭阳市", "云浮市", "梅州市", "潮州市", "汕尾市", "东莞市", "深圳市", "佛山市", "广州市"};

    String shanxi[] = {"忻州市", "吕梁市", "运城市", "大同市", "朔州市", "太原市", "阳泉市", "晋中市", "临汾市", "长治市", "晋城市"};

    String liaon[] = {"盘锦市", "铁岭市", "抚顺市", "沈阳市", "辽阳市", "本溪市", "阜新市", "朝阳市", "锦州市", "鞍山市", "营口市", "丹东市", "大连市", "葫芦岛市"};

    String henan[] = {"开封市", "洛阳市", "漯河市", "商丘市", "三门峡市", "平顶山市", "周口市", "安阳市", "濮阳市", "新乡市", "焦作市", "郑州市", "许昌市", "驻马店市", "信阳市", "南阳市", "鹤壁市"};

    String jiling[] = {"吉林市", "四平市", "通化市", "白山市", "辽源市", "松原市", "白城市", "长春市", "延边朝鲜族自治州"};

    String zhejiang[] = {"湖州市", "舟山市", "嘉兴市", "杭州市绍兴市", "宁波市", "台州市", "金华市", "丽水市", "温州市", "衢州市"};

    String fujian[] = {"宁德市", "莆田市", "南平市", "福州市", "三明市", "泉州市", "龙岩市", "厦门市", "漳州市"};

    String guizhou[] = {"安顺市", "毕节市", "遵义", "铜仁", "六盘水", "贵阳", "黔南布依族苗族自治州", "黔东南苗族侗族自治州", "黔西南苗族布依族自治州"};

    String qinghai[] = {"玉树市", "果洛海东市", "海西市", "海南市", "海北市", "西宁市", "黄南市"};

    String guangxi[] = {"北海市", "防城港市", "钦州市", "贵港市", "百色市", "贺州市", "河池市", "来宾市", "崇左市", "桂林市", "柳州市", "梧州市", "玉林市", "南宁市"};

    String yunnan[] = {"曲靖市", "玉溪市", "普洱市", "保山市", "丽江市", "昆明市", "临沧市", "昭通市", "西双版纳州", "大理州", "楚雄州", "红河州", "文山州", "德宏州", "怒江州", "迪庆州"};

    String anhui[] = {"芜湖市", "马鞍山市", "淮北市", "铜陵市", "黄山市", "池州市", "亳州市", "宿州市", "蚌埠市", "淮南市", "阜阳市", "滁州市", "合肥市", "六安市安庆市", "宣城市"};

    String shanXi[] = {"渭南市", "延安市", "商洛市", "榆林市", "铜川市", "咸阳市", "宝鸡市", "汉中市", "安康市", "西安市", "重庆市"};

    String hunan[] = {"株洲市", "湘潭市", "邵阳市", "岳阳市", "常德市", "益阳市", "娄底市", "长沙市", "衡阳市", "永州市", "怀化市", "张家界市", "郴州市", "湘西土家族苗族自治州"};

    String hebei[] = {"承德市", "秦皇岛市", "唐山市", "张家口市", "廊坊市", "保定市", "沧州市", "衡水市", "石家庄市", "邢台市", "邯郸市"};

    String jiangxi[] = {"九江市", "鹰潭市", "新余市", "景德镇市", "抚州市", "上饶市", "南昌市", "宜春市", "萍乡市", "赣州市", "吉安市"};

    String hainan[] = {"海口市", "三亚市", "海南岛"};

    String tianjin[] = {"蓟县", "静海县", "宁河县", "静海县", "宝坻区", "武清区", "滨海新区", "津南区", "北辰区", "红桥区", "河北区", "河东区", "河西区", "和平区", "西青区", "红桥区"};

    String hubei[] = {"黄石市", "十堰市", "宜昌市", "荆门市", "鄂州市", "孝感市", "黄冈市", "随州市", "恩施州", "襄阳市", "武汉市", "咸宁市", "荆州市"};

    String shando[] = {"烟台市", "日照市", "威海市", "莱芜市", "枣庄市", "菏泽市", "德州市", "滨州市", "东营市", "潍坊市", "青岛市", "聊城市", "济南市", "临沂市", "南岛市", "淄博市", "泰安市"};

    String heiloj[] = {"佳木斯市", "鹤岗市", "鸡西市", "双鸭山市", "黑河市", "七台河市", "绥化市", "伊春市", "牡丹江市", "哈尔滨市", "大庆市", "齐齐哈尔市", "大兴安岭地区"};

    String neimeng[] = {"呼伦贝尔市", "通辽市", "乌海市", "赤峰市", "乌兰察布市", "额鄂尔多斯市", "包头市", "呼和浩特市", "巴彦淖尔市", "锡林郭勒盟", "阿拉善盟", "兴安盟"};

    String xizhang[] = {"阿里地区", "那曲地区", "昌都地区", "林芝地区", "山南地区", "日喀则地区", "拉萨市"};

    //电话号码
    String phome[] = {"139", "138", "137", "136", "135", "134", "159", "158", "157", "150", "151", "152", "188", "130", "131", "132", "156", "155", "133", "153", "189", "183", "187"};
    Map<String, String[]> address = new HashMap<String, String[]>();

    @Test
    public String getProvince() {
        address.put("四川", sichuan);
        address.put("江苏", jiangs);
        address.put("甘肃", gans);
        address.put("宁夏", ningx);
        address.put("新疆", xinj);
        address.put("北京", beij);
        address.put("上海", shanghi);
        address.put("山西", shanxi);
        address.put("辽宁", liaon);
        address.put("河南", henan);
        address.put("吉林", jiling);
        address.put("浙江", zhejiang);
        address.put("福建", fujian);
        address.put("贵州", guizhou);
        address.put("青海", qinghai);
        address.put("广西", guangxi);
        address.put("广东",guangdo);
        address.put("云南", yunnan);
        address.put("安徽", anhui);
        address.put("陕西", shanXi);
        address.put("湖南", hunan);
        address.put("河北", hebei);
        address.put("江西", jiangxi);
        address.put("海南", hainan);
        address.put("天津", tianjin);
        address.put("湖北", hubei);
        address.put("山东", shando);
        address.put("黑龙江", heiloj);
        address.put("内蒙古", neimeng);
        address.put("西藏", xizhang);
        //Set<String> value = address.keySet();
        String  pros[]={"四川","江苏","甘肃","宁夏","新疆","北京","上海","山西","辽宁","河南","吉林","浙江","福建","河北",
                "江西","海南","天津","湖北","山东","黑龙江","内蒙古","西藏","贵州","青海","广西","云南","安徽","陕西","湖南","广东"
        };
        double d=Math.random();
        //计算一共有多少个省
        int pro=pros.length;
        int sc=(int)(d*pro);
        //随机获取一个省
        String shen=pros[sc];
        //获取省里面的市
        String[] as = address.get(shen);
        //计算有多少个市
        int shi=as.length;
        double a=Math.random();
        int si=(int)(a*shi);
        //组合成省+市
        String adrs=shen+as[si];
        return adrs;
 //计算所有省;
//        int ss=value.size();
//         System.out.println(ss);
        //获取省
//     for (String s : value){
        //获取市
//        for (String ok : as) {
////            System.out.println("四川省" + ok + "市");
////        }
//    }
    }
@Test
    public String getPhone(){
        double d=Math.random();//随机数生成
        Random random = new Random();
        int len=phome.length;
        int index=(int)(d*len);
        //生成8位数的随机数
        int i = random.nextInt(99999999)%(99999999-10000000+1) + 10000000;
        String less=String.valueOf(i);
        String number=phome[index]+less;
        //生成电话号码
//        System.out.println(number);
        return number;
    }
    @Test
    public String getName(){
        double d=Math.random();
        double s=Math.random();
        double ss=Math.random();
        double sas=Math.random();
        int xin=xing.length;
        int min=ming.length;
        int x=(int)(d*xin);
        int m=(int)(s*min);
        int as=(int)(ss*1000);
        int index=(int)(sas*10);
        String name;
        String getmin;
        //获取姓
        String getxin=xing[x];
        //获取名
        if(index % 2==0){
           getmin=ming[m];
        }else {
            getmin=ming[m]+ming[as];
        }
        name=getxin+getmin;
       return name;
    }
    public String getSex(){
        double d=Math.random();
        String sex;
        int a=(int)(d*5)+1;
        if(a % 2==0){
            sex="男";
        }else {
            sex="女";
        }
        return sex;
    }
    public  String getAge(){
        double d=Math.random();
        int b=(int)(d*80)+1;
        String age=String.valueOf(b);
        return age;
    }
}


